
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 9 to change, 3 to destroy.</code></pre>

* Update
  * azapi_resource.add_local_user
  * module.correspondence-topic.azurerm_servicebus_topic.servicebus_topic
  * module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic
  * module.metric-alert.azurerm_resource_group_template_deployment.metric-alert
  * module.sftp_storage.azurerm_storage_account.storage_account
  * module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Delete
  * module.notifications-subscription.azurerm_servicebus_subscription.servicebus_subscription
* Replace
  * module.correspondence-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.add_local_user will be updated in-place
  ~ resource "azapi_resource" "add_local_user" {
      ~ body                      = (sensitive value)
        id                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Storage/storageAccounts/sscssftpprod/localUsers/sscsprod"
        name                      = (sensitive value)
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (6 unchanged attributes hidden)
    }

  # module.correspondence-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "sscs-correspondence-topic-prod"
      + namespace_name                          = "sscs-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "sscs-prod"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.correspondence-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod/subscriptions/sscs-correspondence-subscription-prod" -> (known after apply)
        name                                      = "sscs-correspondence-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.correspondence-topic.azurerm_servicebus_topic.servicebus_topic will be updated in-place
  ~ resource "azurerm_servicebus_topic" "servicebus_topic" {
        id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-correspondence-topic-prod"
      ~ max_message_size_in_kilobytes           = 2048 -> 3072
        name                                    = "sscs-correspondence-topic-prod"
        # (11 unchanged attributes hidden)
    }

  # module.evidenceshare-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "sscs-evidenceshare-topic-prod"
      + namespace_name                          = "sscs-servicebus-prod"
      + requires_duplicate_detection            = (known after apply)
      + resource_group_name                     = "sscs-prod"
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ auto_delete_on_idle                       = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
      ~ id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod/subscriptions/sscs-evidenceshare-subscription-prod" -> (known after apply)
        name                                      = "sscs-evidenceshare-subscription-prod"
      ~ topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.evidenceshare-topic.azurerm_servicebus_topic.servicebus_topic will be updated in-place
  ~ resource "azurerm_servicebus_topic" "servicebus_topic" {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
      ~ default_message_ttl                     = "P10675199DT2H48M5.477S" -> "P10675199DT2H48M5.4775807S"
      ~ enable_batched_operations               = true -> false
        id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod"
      ~ max_message_size_in_kilobytes           = 2048 -> 3072
      ~ max_size_in_megabytes                   = 3072 -> 2048
        name                                    = "sscs-evidenceshare-topic-prod"
        # (7 unchanged attributes hidden)
    }

  # module.metric-alert.data.template_file.actiongrouptemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "actiongrouptemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupsExternalId    = {
                      + type = "string"
                    }
                  + alertDescription          = {
                      + type = "string"
                    }
                  + alertEvaluationFrequency  = {
                      + type = "string"
                    }
                  + alertQuery                = {
                      + type = "string"
                    }
                  + alertSeverity             = {
                      + type = "string"
                    }
                  + alertWindowSize           = {
                      + type = "string"
                    }
                  + commonTags                = {
                      + type = "string"
                    }
                  + location                  = {
                      + type = "string"
                    }
                  + scheduledQueryRulesName   = {
                      + type = "string"
                    }
                  + storageAccountsExternalId = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2022-06-15"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('scheduledQueryRulesName')]"
                      + properties = {
                          + actions                = {
                              + actionGroups     = [
                                  + "[parameters('actionGroupsExternalId')]",
                                ]
                              + actionProperties = {}
                              + customProperties = {}
                            }
                          + autoMitigate           = false
                          + criteria               = {
                              + allOf = [
                                  + {
                                      + dimensions      = []
                                      + failingPeriods  = {
                                          + minFailingPeriodsToAlert  = 1
                                          + numberOfEvaluationPeriods = 1
                                        }
                                      + operator        = "GreaterThan"
                                      + query           = "[parameters('alertQuery')]"
                                      + threshold       = 0
                                      + timeAggregation = "Count"
                                    },
                                ]
                            }
                          + description            = "[parameters('alertDescription')]"
                          + displayName            = "[parameters('scheduledQueryRulesName')]"
                          + enabled                = true
                          + evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          + overrideQueryTimeRange = "P2D"
                          + scopes                 = [
                              + "[parameters('storageAccountsExternalId')]",
                            ]
                          + severity               = "[parameters('alertSeverity')]"
                          + targetResourceTypes    = [
                              + "Microsoft.Storage/storageAccounts",
                            ]
                          + windowSize             = "[parameters('alertWindowSize')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.metric-alert.azurerm_resource_group_template_deployment.metric-alert will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-email"
        name                = "sscs-fail-alert-sscssftp-email"
      ~ output_content      = jsonencode({}) -> (known after apply)
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "String"
                    }
                  - alertDescription          = {
                      - type = "String"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "String"
                    }
                  - alertQuery                = {
                      - type = "String"
                    }
                  - alertSeverity             = {
                      - type = "String"
                    }
                  - alertWindowSize           = {
                      - type = "String"
                    }
                  - commonTags                = {
                      - type = "String"
                    }
                  - location                  = {
                      - type = "String"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "String"
                    }
                  - storageAccountsExternalId = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.notifications-subscription.azurerm_servicebus_subscription.servicebus_subscription will be destroyed
  # (because azurerm_servicebus_subscription.servicebus_subscription is not in configuration)
  - resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      - auto_delete_on_idle                       = "P10675199DT2H48M5.477S" -> null
      - client_scoped_subscription_enabled        = false -> null
      - dead_lettering_on_filter_evaluation_error = true -> null
      - dead_lettering_on_message_expiration      = true -> null
      - default_message_ttl                       = "P10675199DT2H48M5.4775807S" -> null
      - enable_batched_operations                 = false -> null
      - id                                        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod/subscriptions/sscs-notifications-subscription-prod" -> null
      - lock_duration                             = "PT1M" -> null
      - max_delivery_count                        = 10 -> null
      - name                                      = "sscs-notifications-subscription-prod" -> null
      - requires_session                          = false -> null
      - status                                    = "Active" -> null
      - topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-prod/topics/sscs-evidenceshare-topic-prod" -> null
    }

  # module.sftp_storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Storage/storageAccounts/sscssftpprod"
        name                              = "sscssftpprod"
        tags                              = {
            "application"         = "social-service-child-support"
            "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "production"
            "managedBy"           = "SSCS"
        }
        # (39 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/SSCSF_alert"
        name                = "SSCSF_alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/SSCSF_slack"
        name                = "SSCSF_slack"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/sscs-fail-alert"
        name                = "sscs-fail-alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.Resources/deployments/sscs-sya-submit-fail"
        name                = "sscs-sya-submit-fail"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 9 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":185,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->